In [1]:
import pandas as pd
import numpy as np
import statsmodels.formula.api as smf
import statsmodels.api as sm
import time
import datetime

In [2]:
salesperson = pd.read_csv('salesperson.csv')
customer = pd.read_csv('customer.csv')
orders = pd.read_csv('orders.csv')

In [3]:
data = pd.merge(orders, salesperson, left_on = 'salesperson_id', right_on = 'ID', how = 'left')
data = pd.merge(data, customer, left_on = 'cust_id', right_on = 'ID', how = 'left')
data

,Number,order_date,cust_id,salesperson_id,Amount,ID_x,Name_x,Age,Salary,ID_y,Name_y,City,Industry Type
0,10,08/02/96,4,2,2400,2,Bob,34,44000,4,Samsonic,pleasant,J
1,20,1/30/99,4,8,1800,8,Ken,57,115000,4,Samsonic,pleasant,J
2,30,7/14/95,9,1,460,1,Abe,61,140000,9,Orange,Jackson,B
3,40,1/29/98,7,2,540,2,Bob,34,44000,7,Samony,jackson,B
4,50,02/03/98,6,7,600,7,Dan,41,52000,6,Panasung,oaktown,J
5,60,03/02/98,6,7,720,7,Dan,41,52000,6,Panasung,oaktown,J
6,70,05/06/98,9,7,150,7,Dan,41,52000,9,Orange,Jackson,B

In [4]:
data[data['Name_y'] == 'Samsonic']['Name_x']

0    Bob
1    Ken
Name: Name_x, dtype: object

In [5]:
pd.unique(data[data['Name_y'] != 'Samsonic']['Name_x'])

array(['Abe', 'Bob', 'Dan'], dtype=object)

In [6]:
data.groupby('Name_x').size()[data.groupby('Name_x').size() >= 2]

Name_x
Bob    2
Dan    3
dtype: int64

In [7]:
highAchiever = pd.DataFrame(columns= [['Name_x', 'Age']])
highAchiever = highAchiever.append(data[data['Salary'] > 10000][['Name_x', 'Age']])
print highAchiever

  Name_x  Age
0    Bob   34
1    Ken   57
2    Abe   61
3    Bob   34
4    Dan   41
5    Dan   41
6    Dan   41

In [8]:
today = datetime.date.today()
print today
print pd.to_datetime('2016-01-13').date()

2016-02-14
2016-01-13

In [9]:
today - pd.to_datetime('2016-03-13').date()== datetime.timedelta(days = 30)

False

In [10]:
data.groupby('ID_x', as_index = False).size()[data.groupby('ID_x', as_index = False).size() >= 2].index.tolist()

[2, 7]

In [11]:
data

,Number,order_date,cust_id,salesperson_id,Amount,ID_x,Name_x,Age,Salary,ID_y,Name_y,City,Industry Type
0,10,08/02/96,4,2,2400,2,Bob,34,44000,4,Samsonic,pleasant,J
1,20,1/30/99,4,8,1800,8,Ken,57,115000,4,Samsonic,pleasant,J
2,30,7/14/95,9,1,460,1,Abe,61,140000,9,Orange,Jackson,B
3,40,1/29/98,7,2,540,2,Bob,34,44000,7,Samony,jackson,B
4,50,02/03/98,6,7,600,7,Dan,41,52000,6,Panasung,oaktown,J
5,60,03/02/98,6,7,720,7,Dan,41,52000,6,Panasung,oaktown,J
6,70,05/06/98,9,7,150,7,Dan,41,52000,9,Orange,Jackson,B

In [12]:
data[data.groupby(['Name_x'])['Amount'].transform(max) == data['Amount']]

,Number,order_date,cust_id,salesperson_id,Amount,ID_x,Name_x,Age,Salary,ID_y,Name_y,City,Industry Type
0,10,08/02/96,4,2,2400,2,Bob,34,44000,4,Samsonic,pleasant,J
1,20,1/30/99,4,8,1800,8,Ken,57,115000,4,Samsonic,pleasant,J
2,30,7/14/95,9,1,460,1,Abe,61,140000,9,Orange,Jackson,B
5,60,03/02/98,6,7,720,7,Dan,41,52000,6,Panasung,oaktown,J

In [13]:
ind = data.groupby(['Name_x'])['Amount'].transform(max) == data['Amount']
data[ind][['Number', 'cust_id', 'Name_x','Amount']]

   Number  cust_id Name_x  Amount
0      10        4    Bob    2400
1      20        4    Ken    1800
2      30        9    Abe     460
5      60        6    Dan     720

In [14]:
data['Amount'].sort_values(ascending = False)[2]
data.head()

,Number,order_date,cust_id,salesperson_id,Amount,ID_x,Name_x,Age,Salary,ID_y,Name_y,City,Industry Type
0,10,08/02/96,4,2,2400,2,Bob,34,44000,4,Samsonic,pleasant,J
1,20,1/30/99,4,8,1800,8,Ken,57,115000,4,Samsonic,pleasant,J
2,30,7/14/95,9,1,460,1,Abe,61,140000,9,Orange,Jackson,B
3,40,1/29/98,7,2,540,2,Bob,34,44000,7,Samony,jackson,B
4,50,02/03/98,6,7,600,7,Dan,41,52000,6,Panasung,oaktown,J

In [15]:
data['order_date'] = pd.to_datetime(data['order_date'])
data.head()

,Number,order_date,cust_id,salesperson_id,Amount,ID_x,Name_x,Age,Salary,ID_y,Name_y,City,Industry Type
0,10,1996-08-02,4,2,2400,2,Bob,34,44000,4,Samsonic,pleasant,J
1,20,1999-01-30,4,8,1800,8,Ken,57,115000,4,Samsonic,pleasant,J
2,30,1995-07-14,9,1,460,1,Abe,61,140000,9,Orange,Jackson,B
3,40,1998-01-29,7,2,540,2,Bob,34,44000,7,Samony,jackson,B
4,50,1998-02-03,6,7,600,7,Dan,41,52000,6,Panasung,oaktown,J

In [16]:
data[data['order_date'] > pd.to_datetime('1999-01-01')]

,Number,order_date,cust_id,salesperson_id,Amount,ID_x,Name_x,Age,Salary,ID_y,Name_y,City,Industry Type
1,20,1999-01-30,4,8,1800,8,Ken,57,115000,4,Samsonic,pleasant,J

In [17]:
print pd.to_datetime('06/06/98', format = '%m/%d/%y').date()

1998-06-06

In [23]:
data[data.groupby('Name_x')['Amount'].transform(max) == data['Amount']]

,Number,order_date,cust_id,salesperson_id,Amount,ID_x,Name_x,Age,Salary,ID_y,Name_y,City,Industry Type
0,10,1996-08-02,4,2,2400,2,Bob,34,44000,4,Samsonic,pleasant,J
1,20,1999-01-30,4,8,1800,8,Ken,57,115000,4,Samsonic,pleasant,J
2,30,1995-07-14,9,1,460,1,Abe,61,140000,9,Orange,Jackson,B
5,60,1998-03-02,6,7,720,7,Dan,41,52000,6,Panasung,oaktown,J

In [26]:
a = np.array([1, 2, 3])
np.reshape(a, (1,3))

array([[1, 2, 3]])